{
  "schemaVersion": 1,
  "sourceManifest": "tmp/avatar_variations/manifest.json",
  "selection": "starter_pack",
  "count": 96,
  "renderer": "base-rig-volumetric-game-sprite-v1",
  "items": [
    {
      "spriteId": "look_player_guard_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_white__skin_fair__hair_fade_brown__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_3b5ee0310d783ce9.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_3b5ee0310d783ce9.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-6",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "white",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_asian__skin_golden__hair_straight_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_5d409d640f10a37c.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_5d409d640f10a37c.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-240",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "asian",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "golden",
        "hairStyle": "straight",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_black__skin_deep__hair_curls_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_adb84c21d46f95a9.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_adb84c21d46f95a9.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-480",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "black",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "deep",
        "hairStyle": "curls",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_latino__skin_bronze__hair_fade_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_3d4742189c9af9a0.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_3d4742189c9af9a0.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-630",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "latino",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "bronze",
        "hairStyle": "fade",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_medium_01__gender_male__build_medium__height_standard__base_white__skin_fair__hair_fade_brown__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_6c278899b9241f11.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_6c278899b9241f11.webp",
      "sourceBaseRigAssetId": "player_male_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-846",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "white",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_medium_01__gender_male__build_medium__height_standard__base_asian__skin_golden__hair_straight_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_3307336cc94ac444.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_3307336cc94ac444.webp",
      "sourceBaseRigAssetId": "player_male_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-1080",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "asian",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "golden",
        "hairStyle": "straight",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_medium_01__gender_male__build_medium__height_standard__base_black__skin_deep__hair_curls_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_d0914859d9fc2081.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_d0914859d9fc2081.webp",
      "sourceBaseRigAssetId": "player_male_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-1320",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "black",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "deep",
        "hairStyle": "curls",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_medium_01__gender_male__build_medium__height_standard__base_latino__skin_bronze__hair_fade_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_32dd2d30d52441f8.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_32dd2d30d52441f8.webp",
      "sourceBaseRigAssetId": "player_male_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-1470",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "latino",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "bronze",
        "hairStyle": "fade",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_big_01__gender_male__build_big__height_standard__base_white__skin_fair__hair_fade_brown__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_e985d4790f6a42d1.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_e985d4790f6a42d1.webp",
      "sourceBaseRigAssetId": "player_male_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-1686",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "white",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_big_01__gender_male__build_big__height_standard__base_asian__skin_golden__hair_straight_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_49c687cc03599304.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_49c687cc03599304.webp",
      "sourceBaseRigAssetId": "player_male_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-1920",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "asian",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "golden",
        "hairStyle": "straight",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_big_01__gender_male__build_big__height_standard__base_black__skin_deep__hair_curls_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_950e17b91fae1041.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_950e17b91fae1041.webp",
      "sourceBaseRigAssetId": "player_male_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-2160",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "black",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "deep",
        "hairStyle": "curls",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_male_big_01__gender_male__build_big__height_standard__base_latino__skin_bronze__hair_fade_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_93a8cd90b5bd5db8.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_93a8cd90b5bd5db8.webp",
      "sourceBaseRigAssetId": "player_male_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-2310",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "latino",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "bronze",
        "hairStyle": "fade",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_male_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_skinny_01__gender_female__build_skinny__height_standard__base_white__skin_fair__hair_fade_brown__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_d44768cfac1d26c7.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_d44768cfac1d26c7.webp",
      "sourceBaseRigAssetId": "player_female_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-2526",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "white",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_skinny_01__gender_female__build_skinny__height_standard__base_asian__skin_golden__hair_straight_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_3508835a82fb4cd2.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_3508835a82fb4cd2.webp",
      "sourceBaseRigAssetId": "player_female_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-2760",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "asian",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "golden",
        "hairStyle": "straight",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_skinny_01__gender_female__build_skinny__height_standard__base_black__skin_deep__hair_curls_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_6abc00e3b1f24bcb.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_6abc00e3b1f24bcb.webp",
      "sourceBaseRigAssetId": "player_female_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-3000",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "black",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "deep",
        "hairStyle": "curls",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_skinny_01__gender_female__build_skinny__height_standard__base_latino__skin_bronze__hair_fade_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_ebb7be6a841298d2.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_ebb7be6a841298d2.webp",
      "sourceBaseRigAssetId": "player_female_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-3150",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "latino",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "bronze",
        "hairStyle": "fade",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_medium_01__gender_female__build_medium__height_standard__base_white__skin_fair__hair_fade_brown__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_37923c1bb431e4b3.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_37923c1bb431e4b3.webp",
      "sourceBaseRigAssetId": "player_female_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-3366",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "white",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_medium_01__gender_female__build_medium__height_standard__base_asian__skin_golden__hair_straight_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_5b61615e71f224f6.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_5b61615e71f224f6.webp",
      "sourceBaseRigAssetId": "player_female_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-3600",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "asian",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "golden",
        "hairStyle": "straight",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_medium_01__gender_female__build_medium__height_standard__base_black__skin_deep__hair_curls_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_e94c28bf6acdd147.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_e94c28bf6acdd147.webp",
      "sourceBaseRigAssetId": "player_female_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-3840",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "black",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "deep",
        "hairStyle": "curls",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_medium_01__gender_female__build_medium__height_standard__base_latino__skin_bronze__hair_fade_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_026fb91608c5111e.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_026fb91608c5111e.webp",
      "sourceBaseRigAssetId": "player_female_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-3990",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "latino",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "bronze",
        "hairStyle": "fade",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_big_01__gender_female__build_big__height_standard__base_white__skin_fair__hair_fade_brown__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_276bc6a52381611d.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_276bc6a52381611d.webp",
      "sourceBaseRigAssetId": "player_female_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-4206",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "white",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_big_01__gender_female__build_big__height_standard__base_asian__skin_golden__hair_straight_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_0006d170a41c2688.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_0006d170a41c2688.webp",
      "sourceBaseRigAssetId": "player_female_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-4440",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "asian",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "golden",
        "hairStyle": "straight",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_big_01__gender_female__build_big__height_standard__base_black__skin_deep__hair_curls_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_76dfb385bc3615cd.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_76dfb385bc3615cd.webp",
      "sourceBaseRigAssetId": "player_female_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-4680",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "black",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "deep",
        "hairStyle": "curls",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_guard_01__rig_player_female_big_01__gender_female__build_big__height_standard__base_latino__skin_bronze__hair_fade_black__outfit_jersey__stance_triplethreat__accessory_sleeve__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_70ed11cc670d0714.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_70ed11cc670d0714.webp",
      "sourceBaseRigAssetId": "player_female_big_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-4830",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "female",
        "baseAppearance": "latino",
        "bodyType": "big",
        "height": "standard",
        "skinTone": "bronze",
        "hairStyle": "fade",
        "hairColor": "black",
        "outfit": "jersey",
        "stance": "tripleThreat",
        "accessory": "sleeve",
        "courtVibe": "proAm",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_guard_01",
        "modelBaseRigAssetId": "player_female_big_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_locked_in_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_white__skin_fair__hair_fade_brown__outfit_hoodie__stance_crossedarms__accessory_headband__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_9a969789a307d191.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_9a969789a307d191.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-5046",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "white",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "hoodie",
        "stance": "crossedArms",
        "accessory": "headband",
        "courtVibe": "rec",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_locked_in_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_locked_in_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_asian__skin_golden__hair_straight_black__outfit_hoodie__stance_crossedarms__accessory_headband__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_bb710cba0de0e7a2.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_bb710cba0de0e7a2.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-5280",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "asian",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "golden",
        "hairStyle": "straight",
        "hairColor": "black",
        "outfit": "hoodie",
        "stance": "crossedArms",
        "accessory": "headband",
        "courtVibe": "rec",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_locked_in_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_locked_in_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_black__skin_deep__hair_curls_black__outfit_hoodie__stance_crossedarms__accessory_headband__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_3859fdd7e12a1e0f.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_3859fdd7e12a1e0f.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-5520",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "black",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "deep",
        "hairStyle": "curls",
        "hairColor": "black",
        "outfit": "hoodie",
        "stance": "crossedArms",
        "accessory": "headband",
        "courtVibe": "rec",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_locked_in_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_locked_in_01__rig_player_male_skinny_01__gender_male__build_skinny__height_standard__base_latino__skin_bronze__hair_fade_black__outfit_hoodie__stance_crossedarms__accessory_headband__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_0bf70a644cf7321c.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_0bf70a644cf7321c.webp",
      "sourceBaseRigAssetId": "player_male_skinny_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-5670",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "latino",
        "bodyType": "skinny",
        "height": "standard",
        "skinTone": "bronze",
        "hairStyle": "fade",
        "hairColor": "black",
        "outfit": "hoodie",
        "stance": "crossedArms",
        "accessory": "headband",
        "courtVibe": "rec",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_locked_in_01",
        "modelBaseRigAssetId": "player_male_skinny_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
        "modelRigContract": "hooprank_base_avatar_rig_v1",
        "modelTopology": "reusableBaseRig",
        "modelCapabilities": [
          "runtimeMaterialColors",
          "hairVisibilityNodes",
          "outfitVisibilityNodes",
          "heightMorphTargets",
          "namedAnimationClips",
          "transparentMapSprite"
        ]
      }
    },
    {
      "spriteId": "look_player_locked_in_01__rig_player_male_medium_01__gender_male__build_medium__height_standard__base_white__skin_fair__hair_fade_brown__outfit_hoodie__stance_crossedarms__accessory_headband__fit_orange__primary_f97316__secondary_111827__jersey_23",
      "path": "assets/avatar_sprites/avatar_525034111c3b0bb9.webp",
      "spriteAssetPath": "assets/avatar_sprites/avatar_525034111c3b0bb9.webp",
      "sourceBaseRigAssetId": "player_male_medium_01",
      "rendererSource": "six_base_body_volumetric_mesh",
      "config": {
        "type": "generatedHoopRankAvatar",
        "seed": "avatar-variation-5886",
        "label": "HoopRank Player",
        "variant": 0,
        "position": null,
        "isNewPlayer": false,
        "gender": "male",
        "baseAppearance": "white",
        "bodyType": "medium",
        "height": "standard",
        "skinTone": "fair",
        "hairStyle": "fade",
        "hairColor": "brown",
        "outfit": "hoodie",
        "stance": "crossedArms",
        "accessory": "headband",
        "courtVibe": "rec",
        "primaryColor": "#F97316",
        "secondaryColor": "#111827",
        "jerseyNumber": "23",
        "modelAssetId": "player_locked_in_01",
        "modelBaseRigAssetId": "player_male_medium_01",
        "modelSource": "productionDcc",
        "modelQualityTier": "modernGameRig",
