{
  "schemaVersion": 1,
  "status": "awaiting_production_dcc_assets",
  "modelViewer": {
    "defaultCameraOrbit": "0deg 72deg 3.2m",
    "defaultCameraTarget": "0m 1.12m 0m",
    "defaultFieldOfView": "20deg",
    "defaultScale": "1 1 1"
  },
  "baseRigTargets": [
    {
      "modelAssetId": "player_male_skinny_01",
      "label": "Male Skinny Base",
      "gender": "male",
      "build": "skinny",
      "modelUrl": "assets/avatar_models/player_male_skinny_01.glb",
      "modelPosterUrl": "assets/avatar_models/player_male_skinny_01_poster.webp",
      "modelSpriteUrl": "assets/avatar_models/player_male_skinny_01_sprite.webp",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ],
      "requiredAnimationClips": [
        "tripleThreatIdle",
        "lockedInIdle",
        "jumperIdle",
        "dribbleIdle"
      ],
      "requiredMaterialSlots": [
        "avatar_skin",
        "avatar_skin_shadow",
        "avatar_hair",
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_jersey_primary",
        "avatar_shorts_secondary",
        "avatar_trim",
        "avatar_shoe",
        "avatar_sole",
        "avatar_sneaker_accent",
        "avatar_ball",
        "avatar_ball_seam"
      ],
      "requiredVisibilityNodes": [
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_outfit_jersey",
        "avatar_outfit_hoodie",
        "avatar_outfit_warmups",
        "avatar_outfit_tee"
      ],
      "requiredMorphTargets": [
        "avatar_height_compact",
        "avatar_height_tall",
        "avatar_height_center"
      ],
      "runtimeBinding": "base_body_plus_runtime_layers",
      "customizationLayerAxes": [
        "baseAppearance",
        "skinTone",
        "hairStyle",
        "hairColor",
        "height",
        "outfit",
        "clothesTint",
        "stance",
        "modelAnimationName"
      ],
      "assetDelivery": "development_procedural_base_rig_v1"
    },
    {
      "modelAssetId": "player_male_medium_01",
      "label": "Male Medium Base",
      "gender": "male",
      "build": "medium",
      "modelUrl": "assets/avatar_models/player_male_medium_01.glb",
      "modelPosterUrl": "assets/avatar_models/player_male_medium_01_poster.webp",
      "modelSpriteUrl": "assets/avatar_models/player_male_medium_01_sprite.webp",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ],
      "requiredAnimationClips": [
        "tripleThreatIdle",
        "lockedInIdle",
        "jumperIdle",
        "dribbleIdle"
      ],
      "requiredMaterialSlots": [
        "avatar_skin",
        "avatar_skin_shadow",
        "avatar_hair",
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_jersey_primary",
        "avatar_shorts_secondary",
        "avatar_trim",
        "avatar_shoe",
        "avatar_sole",
        "avatar_sneaker_accent",
        "avatar_ball",
        "avatar_ball_seam"
      ],
      "requiredVisibilityNodes": [
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_outfit_jersey",
        "avatar_outfit_hoodie",
        "avatar_outfit_warmups",
        "avatar_outfit_tee"
      ],
      "requiredMorphTargets": [
        "avatar_height_compact",
        "avatar_height_tall",
        "avatar_height_center"
      ],
      "runtimeBinding": "base_body_plus_runtime_layers",
      "customizationLayerAxes": [
        "baseAppearance",
        "skinTone",
        "hairStyle",
        "hairColor",
        "height",
        "outfit",
        "clothesTint",
        "stance",
        "modelAnimationName"
      ],
      "assetDelivery": "development_procedural_base_rig_v1"
    },
    {
      "modelAssetId": "player_male_big_01",
      "label": "Male Big Base",
      "gender": "male",
      "build": "big",
      "modelUrl": "assets/avatar_models/player_male_big_01.glb",
      "modelPosterUrl": "assets/avatar_models/player_male_big_01_poster.webp",
      "modelSpriteUrl": "assets/avatar_models/player_male_big_01_sprite.webp",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ],
      "requiredAnimationClips": [
        "tripleThreatIdle",
        "lockedInIdle",
        "jumperIdle",
        "dribbleIdle"
      ],
      "requiredMaterialSlots": [
        "avatar_skin",
        "avatar_skin_shadow",
        "avatar_hair",
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_jersey_primary",
        "avatar_shorts_secondary",
        "avatar_trim",
        "avatar_shoe",
        "avatar_sole",
        "avatar_sneaker_accent",
        "avatar_ball",
        "avatar_ball_seam"
      ],
      "requiredVisibilityNodes": [
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_outfit_jersey",
        "avatar_outfit_hoodie",
        "avatar_outfit_warmups",
        "avatar_outfit_tee"
      ],
      "requiredMorphTargets": [
        "avatar_height_compact",
        "avatar_height_tall",
        "avatar_height_center"
      ],
      "runtimeBinding": "base_body_plus_runtime_layers",
      "customizationLayerAxes": [
        "baseAppearance",
        "skinTone",
        "hairStyle",
        "hairColor",
        "height",
        "outfit",
        "clothesTint",
        "stance",
        "modelAnimationName"
      ],
      "assetDelivery": "development_procedural_base_rig_v1"
    },
    {
      "modelAssetId": "player_female_skinny_01",
      "label": "Female Skinny Base",
      "gender": "female",
      "build": "skinny",
      "modelUrl": "assets/avatar_models/player_female_skinny_01.glb",
      "modelPosterUrl": "assets/avatar_models/player_female_skinny_01_poster.webp",
      "modelSpriteUrl": "assets/avatar_models/player_female_skinny_01_sprite.webp",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ],
      "requiredAnimationClips": [
        "tripleThreatIdle",
        "lockedInIdle",
        "jumperIdle",
        "dribbleIdle"
      ],
      "requiredMaterialSlots": [
        "avatar_skin",
        "avatar_skin_shadow",
        "avatar_hair",
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_jersey_primary",
        "avatar_shorts_secondary",
        "avatar_trim",
        "avatar_shoe",
        "avatar_sole",
        "avatar_sneaker_accent",
        "avatar_ball",
        "avatar_ball_seam"
      ],
      "requiredVisibilityNodes": [
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_outfit_jersey",
        "avatar_outfit_hoodie",
        "avatar_outfit_warmups",
        "avatar_outfit_tee"
      ],
      "requiredMorphTargets": [
        "avatar_height_compact",
        "avatar_height_tall",
        "avatar_height_center"
      ],
      "runtimeBinding": "base_body_plus_runtime_layers",
      "customizationLayerAxes": [
        "baseAppearance",
        "skinTone",
        "hairStyle",
        "hairColor",
        "height",
        "outfit",
        "clothesTint",
        "stance",
        "modelAnimationName"
      ],
      "assetDelivery": "development_procedural_base_rig_v1"
    },
    {
      "modelAssetId": "player_female_medium_01",
      "label": "Female Medium Base",
      "gender": "female",
      "build": "medium",
      "modelUrl": "assets/avatar_models/player_female_medium_01.glb",
      "modelPosterUrl": "assets/avatar_models/player_female_medium_01_poster.webp",
      "modelSpriteUrl": "assets/avatar_models/player_female_medium_01_sprite.webp",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ],
      "requiredAnimationClips": [
        "tripleThreatIdle",
        "lockedInIdle",
        "jumperIdle",
        "dribbleIdle"
      ],
      "requiredMaterialSlots": [
        "avatar_skin",
        "avatar_skin_shadow",
        "avatar_hair",
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_jersey_primary",
        "avatar_shorts_secondary",
        "avatar_trim",
        "avatar_shoe",
        "avatar_sole",
        "avatar_sneaker_accent",
        "avatar_ball",
        "avatar_ball_seam"
      ],
      "requiredVisibilityNodes": [
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_outfit_jersey",
        "avatar_outfit_hoodie",
        "avatar_outfit_warmups",
        "avatar_outfit_tee"
      ],
      "requiredMorphTargets": [
        "avatar_height_compact",
        "avatar_height_tall",
        "avatar_height_center"
      ],
      "runtimeBinding": "base_body_plus_runtime_layers",
      "customizationLayerAxes": [
        "baseAppearance",
        "skinTone",
        "hairStyle",
        "hairColor",
        "height",
        "outfit",
        "clothesTint",
        "stance",
        "modelAnimationName"
      ],
      "assetDelivery": "development_procedural_base_rig_v1"
    },
    {
      "modelAssetId": "player_female_big_01",
      "label": "Female Big Base",
      "gender": "female",
      "build": "big",
      "modelUrl": "assets/avatar_models/player_female_big_01.glb",
      "modelPosterUrl": "assets/avatar_models/player_female_big_01_poster.webp",
      "modelSpriteUrl": "assets/avatar_models/player_female_big_01_sprite.webp",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ],
      "requiredAnimationClips": [
        "tripleThreatIdle",
        "lockedInIdle",
        "jumperIdle",
        "dribbleIdle"
      ],
      "requiredMaterialSlots": [
        "avatar_skin",
        "avatar_skin_shadow",
        "avatar_hair",
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_jersey_primary",
        "avatar_shorts_secondary",
        "avatar_trim",
        "avatar_shoe",
        "avatar_sole",
        "avatar_sneaker_accent",
        "avatar_ball",
        "avatar_ball_seam"
      ],
      "requiredVisibilityNodes": [
        "avatar_hair_fade",
        "avatar_hair_straight",
        "avatar_hair_curls",
        "avatar_hair_locs",
        "avatar_hair_braids",
        "avatar_hair_buzz",
        "avatar_outfit_jersey",
        "avatar_outfit_hoodie",
        "avatar_outfit_warmups",
        "avatar_outfit_tee"
      ],
      "requiredMorphTargets": [
        "avatar_height_compact",
        "avatar_height_tall",
        "avatar_height_center"
      ],
      "runtimeBinding": "base_body_plus_runtime_layers",
      "customizationLayerAxes": [
        "baseAppearance",
        "skinTone",
        "hairStyle",
        "hairColor",
        "height",
        "outfit",
        "clothesTint",
        "stance",
        "modelAnimationName"
      ],
      "assetDelivery": "development_procedural_base_rig_v1"
    }
  ],
  "requiredSlots": [
    {
      "modelAssetId": "player_guard_01",
      "baseRigAssetIds": [
        "player_male_skinny_01",
        "player_male_medium_01",
        "player_male_big_01",
        "player_female_skinny_01",
        "player_female_medium_01",
        "player_female_big_01"
      ],
      "label": "Guard - Triple Threat",
      "outfit": "jersey",
      "stance": "tripleThreat",
      "modelAnimationName": "tripleThreatIdle",
      "modelCameraOrbit": "0deg 72deg 3.2m",
      "modelCameraTarget": "0m 1.12m 0m",
      "modelFieldOfView": "20deg",
      "modelScale": "1 1 1",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ]
    },
    {
      "modelAssetId": "player_locked_in_01",
      "baseRigAssetIds": [
        "player_male_skinny_01",
        "player_male_medium_01",
        "player_male_big_01",
        "player_female_skinny_01",
        "player_female_medium_01",
        "player_female_big_01"
      ],
      "label": "Locked In - Crossed Arms",
      "outfit": "hoodie",
      "stance": "crossedArms",
      "modelAnimationName": "lockedInIdle",
      "modelCameraOrbit": "0deg 72deg 3.2m",
      "modelCameraTarget": "0m 1.12m 0m",
      "modelFieldOfView": "20deg",
      "modelScale": "1 1 1",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ]
    },
    {
      "modelAssetId": "player_shooter_01",
      "baseRigAssetIds": [
        "player_male_skinny_01",
        "player_male_medium_01",
        "player_male_big_01",
        "player_female_skinny_01",
        "player_female_medium_01",
        "player_female_big_01"
      ],
      "label": "Shooter - Jumper",
      "outfit": "warmups",
      "stance": "jumper",
      "modelAnimationName": "jumperIdle",
      "modelCameraOrbit": "0deg 72deg 3.2m",
      "modelCameraTarget": "0m 1.12m 0m",
      "modelFieldOfView": "20deg",
      "modelScale": "1 1 1",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ]
    },
    {
      "modelAssetId": "player_dribble_01",
      "baseRigAssetIds": [
        "player_male_skinny_01",
        "player_male_medium_01",
        "player_male_big_01",
        "player_female_skinny_01",
        "player_female_medium_01",
        "player_female_big_01"
      ],
      "label": "Ball Handler - Low Dribble",
      "outfit": "tee",
      "stance": "dribble",
      "modelAnimationName": "dribbleIdle",
      "modelCameraOrbit": "0deg 72deg 3.2m",
      "modelCameraTarget": "0m 1.12m 0m",
      "modelFieldOfView": "20deg",
      "modelScale": "1 1 1",
      "modelSource": "productionDcc",
      "modelQualityTier": "modernGameRig",
      "modelRigContract": "hooprank_base_avatar_rig_v1",
      "modelTopology": "reusableBaseRig",
      "modelCapabilities": [
        "runtimeMaterialColors",
        "hairVisibilityNodes",
        "outfitVisibilityNodes",
        "heightMorphTargets",
        "namedAnimationClips",
        "transparentMapSprite"
      ]
    }
  ],
  "notes": "The six base body targets currently point at procedural development GLB rigs generated by tool/generate_avatar_base_rig_pack.py. Development posters and map sprites are mesh-projected from the same procedural rig parts for parity testing. Gender and build select one of six base bodies; race/skin, hair, height, clothes, and pose are runtime customization layers. These are production-shaped runtime assets for scalable testing, but catalog.status remains awaiting_production_dcc_assets until artist/provider-approved source art replaces them."
}
